app/controllers/user_controller.rb

  def create
    @config = Configuration.available_modules

    @user = User.new(params[:user])
    if request.post?

      if @user.save
---
INSERT INTO `users` (`is_deleted`, `reset_password_code_until`, `employee`, `last_name`, `first_name`, `username`, `student`, `salt`, `created_at`, `email`, `parent`, `reset_password_code`, `admin`, `is_first_login`, `hashed_password`, `updated_at`) VALUES (0, NULL, 0, 'admin', 'j', 'j', 0, 'RbqpWSxW', '2014-11-04 09:45:16', 'a@a.com', NULL, NULL, 1, 1, 'a43a215a098f68759c627e15575d18636bda1df3', '2014-11-04 09:45:16')

  def forgot_password
    #    flash[:notice]="You do not have permission to access forgot password!"
    #    redirect_to :action=>"login"
    @network_state = Configuration.find_by_config_key("NetworkState")
---
SELECT `configurations`.* FROM `configurations` WHERE `configurations`.`config_key` = 'NetworkState' LIMIT 1

  def login
    @institute = Configuration.find_by_config_key("LogoName")
    available_login_authes = FedenaPlugin::AVAILABLE_MODULES.select{|m| m[:name].classify.constantize.respond_to?("login_hook")}
    selected_login_hook = available_login_authes.first if available_login_authes.count>=1
    if selected_login_hook
      authenticated_user = selected_login_hook[:name].classify.constantize.send("login_hook",self)
    else
      if request.post? and params[:user]
        @user = User.new(params[:user])
        user = User.active.find_by_username @user.username
---
SELECT `configurations`.* FROM `configurations` WHERE `configurations`.`config_key` = 'AvailableModules'
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'admin' LIMIT 1

  def profile
    @config = Configuration.available_modules
    @current_user = current_user
    @username = @current_user.username if session[:user_id]
    @user = User.active.find_by_username(params[:id])
    unless @user.nil?
      @employee = Employee.find_by_employee_number(@user.username)
      @student = Student.find_by_admission_no(@user.username)
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`employee_number` = 'admin' LIMIT 1
SELECT `students`.* FROM `students` WHERE `students`.`admission_no` = 'admin' LIMIT 1